#+title: Hands on with Git
#+author: Elsa Gonsiorowski
#+date: July 11, 2024

#+options: H:2 toc:1 num:1
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_INIT_OPTIONS: height:1000, slideNumber:'c/t'
#+REVEAL_THEME: solarized

** Query Git
#+begin_src shell :exports both :eval no
git status
#+end_src

#+RESULTS:
#+begin_example
On branch main

No commits yet

nothing to commit (create/copy files and use "git add" to track)
#+end_example

** Add a File
#+begin_src shell :exports both :eval no
  echo "Weronika" > friends.txt
  ls -al
  git status
#+end_src

#+RESULTS:
#+begin_example
 total        0
 drwxr-xr-x   3  gonsiorowski1 59746     96 Jul 11 10:43 .
 drwx------@ 16  gonsiorowski1 59746    512 Jul 11 10:43 ..
 drwxr-xr-x   9  gonsiorowski1 59746    288 Jul 11 10:43 .git
 -rw-r--r--   1  gonsiorowski1 59746     50 Jul 11 11:08 friends.txt

On branch main

No commits yet

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	mars.txt

nothing added to commit but untracked files present (use "git add" to track)
#+end_example
